<meta charset="utf-8">
<?php
// Арифметические операции
//$a = 8 + 2; // 10, сложение
//$a = 8 - 2; // 6, вычетание
//$a = 8 * 2; // 16, умножение
//$a = 8 / 2; // 4, деление
//$a = 8 % 2; // 0, деление по модулю, возвращает остаток после деления
//$a = 8 ** 2; // 64, возведение в степень

// Инкремент
//$a = 12;
//$b = ++$a;
//echo "a = $a <br> b = $b";

//$a = 12;
//$b = $a++;
//echo "a = $a <br> b = $b";

//Объединение строк
//$a = "Привет,";
//$b = "Мир!";
//echo $a . " " .  $b . "!";

// Оператор равенства и тождественности
//$a = (2 == "2");
//$b = (2 === "2");
//var_dump($a);
//var_dump($b);


//$a = ( 0 != 2); //Отрицание равенства
//$b = (2 !== "2"); //Отрицание тождественности
//var_dump($a);
//var_dump($b);

// Логические операторы
//$a = (true && true); // true логическое И
//$a = (true || false); // true логическое ИЛИ

// Операции присваивания
$a = 12;
echo "$a <br>";
$a += 5;
echo $a;



?>